diet_plans = {
    "کمبود وزن": {
        "صبحانه": "تخم‌مرغ آب‌پز یا املت با سبزیجات\nنان سبوس‌دار\nیک عدد میوه",
        "میان‌وعده صبح": "یک مشت مغز یا شیر کم‌چرب با میوه",
        "ناهار": "مرغ یا ماهی با سبزیجات و کمی برنج",
        "عصرانه": "میوه یا ماست کم‌چرب",
        "شام": "سوپ سبزیجات با عدس یا مرغ",
        "قبل از خواب": "یک لیوان شیر"
    },
    "وزن نرمال": {
        "صبحانه": "جو دوسر با شیر کم‌چرب و میوه",
        "میان‌وعده صبح": "یک عدد میوه",
        "ناهار": "مرغ یا ماهی با سبزیجات و برنج قهوه‌ای",
        "عصرانه": "سبزیجات یا مغزها",
        "شام": "سالاد با پروتئین سبک",
        "قبل از خواب": "چای سبز"
    },
    "اضافه وزن": {
        "صبحانه": "تخم‌مرغ و نان سبوس‌دار",
        "میان‌وعده صبح": "ماست کم‌چرب",
        "ناهار": "مرغ یا ماهی با سبزیجات",
        "عصرانه": "میوه",
        "شام": "سوپ سبزیجات",
        "قبل از خواب": "شیر کم‌چرب"
    },
    "چاقی": {
        "صبحانه": "املت سبزیجات",
        "میان‌وعده صبح": "میوه",
        "ناهار": "مرغ یا ماهی کبابی با سالاد",
        "عصرانه": "سبزیجات خام",
        "شام": "سوپ سبزیجات",
        "قبل از خواب": "شیر کم‌چرب"
    }
}
